Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Normalizers are a special type of analyzers that keeps the input as a single token. It is especially useful for sorting or indexing keywords.
ja_jp: ノーマライザーは入力を1つのトークンとして保持する特殊なアナライザです。特に、キーワードのソートやインデックス作成に有効です。

source: Normally a build step is included whenever it produces any build item which is in turn consumed by any other build step. In this way, only the steps necessary to produce the final artifact(s) are included, and steps which pertain to extensions which are not installed or which only produce build items which are not relevant for the given artifact type are excluded.
ja_jp: 通常、ビルドステップは、他のビルドステップで使用されるビルドアイテムを生成する際に必ず含まれます。これにより、最終的なアーティファクトを生成するために必要なステップと、インストールされていないエクステンションに関連するステップ、または指定のアーティファクトタイプに関係のないビルドアイテムのみを生成するステップが含まれます。

source: Normally a collection of `String` values is used to capture the values used in multiple occurrences of the same query parameter. For example, for the following resource method:
ja_jp: 通常、 `String` 値のコレクションは、同じクエリーパラメーターが複数回出現する際に使用される値を取得するために使用されます。 たとえば、次のリソースメソッドの場合:

source: Normally it is an error for a step which is included to consume a simple build item that is not produced by any other step. In this way, it is guaranteed that all of the declared values will be present and non-`null` when a step is run.
ja_jp: 通常、他のステップによって生成されない単純なビルド項目を消費するために含まれるステップはエラーです。 このようにして、ステップの実行時に、宣言された値がすべて存在し、 `null` でないことが保証されます。

source: Normally it is an error for a step which is included to consume a simple build item that is not produced by any other step. In this way, it is guaranteed that all the declared values will be present and non-`null` when a step is run.
ja_jp: 通常、他のステップで生成されない単純なビルドアイテムを消費するために含まれるステップはエラーとなる。このように、ステップの実行時に、宣言された値がすべて存在し、かつ非 `null` であることが保証されます。

source: Normally these two resource methods would end up being documented alongside each other in the same OpenAPI document. These can be visually separated in the same OpenAPI document using tags. For larger deployments with multiple resources, however, this will still lead to:
ja_jp: 通常、これら 2 つのリソースメソッドは同じ OpenAPI ドキュメント内に並んで記述されることになります。これらはタグを使用して同じ OpenAPI ドキュメント内で視覚的に分けることができますが、複数のリソースがある大規模なデプロイメントでは、依然として以下の問題が発生します。

source: Normally we would link to a Git repository to clone but in this case there is no additional files than the following:
ja_jp: 通常は Git リポジトリに関連付けてクローンしますが、今回利用するのは以下のファイルだけです。

source: Normally you would add a separate class, but as we are aiming to have it all in one file you will add a nested class.
ja_jp: 通常は別のクラスを追加しますが、1 つのファイルにまとめようとしているので、ネストされたクラス を追加します。

source: Normally, HQL queries are of this form: `from EntityName [where ...] [order by ...]`, with optional elements at the end.
ja_jp: 通常、HQLのクエリは `from EntityName [where …​] [order by …​]` というように最後にオプションの要素を持つという形式になっています。

source: Normally, MongoDB queries are of this form: `{'firstname': 'John', 'lastname':'Doe'}`, this is what we call MongoDB native queries.
ja_jp: 通常、MongoDB のクエリは `{'firstname': 'John', 'lastname':'Doe'}` 形式です。これを MongoDB ネイティブクエリと呼んでいます。

source: Normally, most HQL queries are of this form: `from EntityName [where ...] [order by ...]`, with optional elements at the end.
ja_jp: 通常、ほとんどのHQLクエリは、`from EntityName [where ...] [order by ...]` という形式で、最後にオプションの要素が続きます。

source: Normally, optional Maven extension dependencies are ignored by the Quarkus dependency resolver at build time. In this case though, the optional dependency `quarkus-extension-b` includes a dependency condition in its extension descriptor, which turns this optional Maven dependency into a Quarkus conditional extension dependency.
ja_jp: 通常、オプションのMavenエクステンション依存関係は、ビルド時にQuarkusの依存関係リゾルバによって無視されます。しかし、この場合は、オプションの依存関係 `quarkus-extension-b` はそのエクステンション記述子に依存関係の条件が含まれており、このオプションのMaven依存関係がQuarkusの条件付きエクステンション依存関係になります。

source: Normally, the solver finds a feasible solution in less than 200 milliseconds. Notice how the `application.properties` overwrites the solver termination during tests to terminate as soon as a feasible solution (`0hard/*soft`) is found. This avoids hard coding a solver time, because the unit test might run on arbitrary hardware. This approach ensures that the test runs long enough to find a feasible solution, even on slow machines. But it does not run a millisecond longer than it strictly must, even on fast machines.
ja_jp: 通常、ソルバーは 200 ミリ秒未満で実行可能なソリューションを見つけます。 `application.properties` は、実行可能なソリューション (`0hard/* soft`) が見つかり次第すぐに終了するように、テスト中にソルバーの終了を上書きすることに注意してください。これにより、ユニットテストが任意のハードウェアで実行される可能性があるため、ソルバー時間をハードコーディングする必要がなくなります。このアプローチにより、低速マシンでも実行可能なソリューションを見つけるのに十分な時間、テストが実行されます。ただし、高速マシンであっても、厳密に必要な時間より 1 ミリ秒も長く実行されることはありません。

source: Not a standalone line - contains an expression and non-whitespace characters
ja_jp: スタンドアロン行ではない - 式と非空白文字を含む

source: Not a standalone line - contains no section tag/parameter declaration
ja_jp: スタンドアロン行ではない - セクションタグ/パラメーター宣言を含まない

source: Not all Java features and libraries are supported out of the box as they are on OpenJDK.
ja_jp: すべての Java 機能とライブラリが OpenJDK と同じようにそのままサポートされているわけではありません。

source: Not all changes can be pushed upstream, extensions host Substrate VM substitutions - which is a form of code patching - so that libraries can run
ja_jp: すべての変更をupstreamにプッシュできるわけではないので、エクステンションは Substrate VM 置換をホスト。これはコードパッチの一形態で、ライブラリが実行できるようになっています。

source: Not all classes required at startup were recorded.
ja_jp: 起動時に必要となるすべてのクラスが記録されたわけではありません。

source: Not all configuration or resources can be consumed at build time. If you have classpath resources that the runtime needs to access, you need to inform the build phase that these resources need to be copied into the native image. This is done by producing one or more `NativeImageResourceBuildItem` or `NativeImageResourceBundleBuildItem` in the case of resource bundles. Examples of this are shown in this sample `registerNativeImageResources` build step:
ja_jp: ビルド時にすべての設定またはリソースを消費できるわけではありません。ランタイムがアクセスする必要のあるクラスパスリソースがある場合は、これらのリソースをネイティブイメージにコピーする必要があることをビルドフェーズに通知する必要があります。そのためには、リソースバンドルの場合、1 つ以上の `NativeImageResourceBuildItem` または `NativeImageResourceBundleBuildItem` を生成することによって行われます。その例を、この `registerNativeImageResources` ビルドステップのサンプルに示します。

source: Not all functionality provided by the built-in extension methods is covered by the default value resolvers. However, a custom value resolver can be easily built via the `ValueResolver.builder()`.
ja_jp: 組み込みの拡張メソッドによって提供されるすべての機能が、デフォルトの値リゾルバーによってカバーされているわけではありません。ただし、カスタムの値リゾルバーは `ValueResolver.builder()` を使って簡単に構築することができます。

source: Not applicable
ja_jp: 該当なし

source: Not available at build, read at start in all modes.
ja_jp: ビルド時には使用できません。すべてのモードで開始時に読み取ります。

source: Not every library is suitable for using with virtual threads, out of the box. xref:virtual-threads.adoc#why-not["Why not virtual threads everywhere?"] explains why.
ja_jp: すべてのライブラリーが、そのままでは仮想スレッドでの使用に適しているわけではありません。 xref:virtual-threads.adoc#why-not["なぜすべての場所で仮想スレッドを使わないのか?"] にその理由が説明されています。

source: Not every problem needs an extension! If you're just bundling up external libraries (that aren't already extensions) and making minor adjustments, you might not need an extension. For example, plain libraries can create new configuration elements and register classes with Jandex (this link:https://www.loicmathieu.fr/wordpress/en/informatique/quarkus-tip-comment-ne-pas-creer-une-extension-quarkus/[blog shows how]).
ja_jp: すべての問題にエクステンションが必要なわけではありません。 外部ライブラリー (まだエクステンションではないもの) をバンドルして、小さな調整を加えるだけの場合は、エクステンションは必要ない場合があります。 たとえば、プレーンライブラリーは新しい設定要素を作成し、Jandex を使用してクラスを登録できます (この link:https://www.loicmathieu.fr/wordpress/en/informatique/quarkus-tip-comment-ne-pas-creer-une-extension-quarkus/[ブログで方法が示されています])。

source: Not managed by the garbage collector, reducing GC pressure.
ja_jp: ガベージコレクターによって管理されないため、GCの負荷を軽減します。

source: Not present
ja_jp: 存在しません

source: Not validated - `foo` is overridden in the loop section.
ja_jp: 検証されていません - `foo` はループセクションでオーバーライドされています。

source: Not validated - not matching a param declaration.
ja_jp: 検証されていません - パラメーター宣言にマッチしません。

source: Not very exciting, but we can change this by instructing JReleaser to format the changelog according to our own conventions. You can manually specify patterns to categorize commits however if you chose to follow Conventional Commits we can instruct JReleaser to do the same. Add the following to the JReleaser plugin configuration section:
ja_jp: あまりエキサイティングではありません。しかし、JReleaser に独自の規約に従ってチェンジログをフォーマットするように指示することでこれを変更することが出来ます。パターンを手動で指定してコミットを分類できますが、規約に沿ったコミットに従うことを選択した場合は、JReleaser に同じことを行うように指示できます。JReleaser プラグイン設定セクションに以下を追加します:

source: Not very exicting. But we can change this by instructing JReleaser to format the changelog according to our own conventions. You can manually specify patterns to categorize commits however if you chose to follow Conventional Commits we can instruct JReleaser to do the same. Add the following to the JReleaser plugin configuration section:
ja_jp: あまりエキサイティングではありません。ただし、これを変更するには、JReleaser に独自の規則に従って変更ログをフォーマットするように指示します。パターンを手動で指定してコミットを分類できますが、従来のコミットに従うことを選択した場合は、JReleaser に同じことを行うように指示できます。JReleaser プラグイン設定セクションに以下を追加します。

source: Notable Qute features included in Quarkus Tools for Visual Studio Code 1.10.0 include:
ja_jp: Quarkus Tools for Visual Studio Code 1.10.0に含まれるQuteの注目すべき機能は以下のとおりです。

source: Note
ja_jp: 注記

source: Note Keycloak may return an error when you try to `Log into Single Page Application`. For example, `quarkus.oidc.client-id` may not match the client id in the realm imported to Keycloak or the client in this realm is not configured correctly to support the authorization code flow, etc. In such cases Keycloak will return an `error_description` query parameter and `Dev UI` will also show this error description, for example:
ja_jp: シングルページアプリケーションにログインしようとすると、Keycloak がエラーを返す場合があることに注意してください。たとえば、 `quarkus.oidc.client-id` が Keycloak にインポートされたレルムのクライアント ID と一致しない場合や、このレルムのクライアントが認可コードフローをサポートするように正しく設定されていない場合などです。このような場合、Keycloak は `error_description` クエリーパラメーターと `DevUI` も、このエラーの説明を表示します。以下はその例です。

source: Note Quarkus `web-app` applications always require `quarkus.oidc.client-id` property.
ja_jp: Quarkus の `web-app` アプリケーションには、常に `quarkus.oidc.client-id` プロパティーが必要である点に注意してください。

source: Note `AccessTokenRequestFilter` will use `OidcClient` to exchange the current token and you can use `quarkus.oidc-client.grant-options.exchange` to set the additional exchange properties expected by your OpenID Connect Provider.
ja_jp: `AccessTokenRequestFilter` は `OidcClient` を使用して現在のトークンを交換し、 `quarkus.oidc-client.grant-options.exchange` を使用して OpenID Connect プロバイダーが期待する追加の交換プロパティーを設定できる点に留意してください。

source: Note `AccessTokenRequestFilter` will use `OidcClient` to exchange the current token, and you can use `quarkus.oidc-client.grant-options.exchange` to set the additional exchange properties expected by your OpenID Connect Provider.
ja_jp: `AccessTokenRequestFilter` は `OidcClient` を使用して現在のトークンを交換することに注意してください。また、 `quarkus.oidc-client.grant-options.exchange` を使用して OpenID Connect プロバイダーが期待する追加の交換プロパティーを設定できます。

source: Note `AccessTokenRequestReactiveFilter` will use `OidcClient` to exchange the current token, and you can use `quarkus.oidc-client.grant-options.exchange` to set the additional exchange properties expected by your OpenID Connect Provider.
ja_jp: `AccessTokenRequestReactiveFilter` は `OidcClient` を使用して現在のトークンを交換することに注意してください。また、 `quarkus.oidc-client.grant-options.exchange` を使用して OpenID Connect プロバイダーが期待する追加の交換プロパティーを設定できます。

source: Note a custom Auth0 claim has to be namespace qualified, so the claim which will contain roles will be named as "https://quarkus-security.com/roles". Have a look at the ID token content we analyzed in the previous sections and you will see how this claim is represented, for example:
ja_jp: カスタム Auth0 クレームは namespace で修飾される必要があるため、ロールを含むクレームの名前は https://quarkus-security.com/roles になります。前のセクションで分析した ID トークンのコンテンツを確認すると、このクレームがどのように表現されているかがわかります。以下はその例です。

source: Note about icons
ja_jp: アイコンに関する注意事項

source: Note all the properties in the JSON are optional, and only those that are needed should be used.
ja_jp: JSON 内のすべてのプロパティーはオプションであり、使用できるのは必要なものだけである点に注意してください。

source: Note also that some consumers such as `agroal` will add to their connection configuration any properties returned by the credentials provider, not just the username and password. So when you design the new credentials provider limit the properties to what would be understood by consumers, or provide appropriate configuration options to support different modes.
ja_jp: また、 `agroal` のようなコンシューマーの中には、ユーザー名とパスワードだけでなく、クレデンシャル・プロバイダが返すプロパティーを接続設定に追加するものがあることにも注意してください。したがって、新しいクレデンシャル・プロバイダーを設計する際には、プロパティーをコンシューマーが理解できるものに限定するか、または異なるモードをサポートするための適切な設定オプションを提供してください。

source: Note also that starting Quarkus 3.19, the default _builder_ images are based on UBI 9. To use the previous UBI 8 based images, you can use the pick an image from the https://quay.io/repository/quarkus/ubi-quarkus-mandrel-builder-image?tab=tags[quay.io repository].
ja_jp: また、Quarkus 3.19から、デフォルトの _ビルダーイメージは_ UBI 9に基づいています。以前のUBI 8ベースのイメージを使用するには、 link:https://quay.io/repository/quarkus/ubi-quarkus-mandrel-builder-image?tab=tags[quay.ioリポジトリ] からイメージを選択してください。

source: Note also the special return type of the `findAll` method, link:https://docs.datastax.com/en/drivers/java/latest/com/datastax/oss/driver/api/core/PagingIterable.html[`PagingIterable`]: it's the base type of result sets returned by the driver.
ja_jp: `findAll` メソッドの特別なリターンタイプにも注意してください link:https://docs.datastax.com/en/drivers/java/latest/com/datastax/oss/driver/api/core/PagingIterable.html[`PagingIterable`]: これはドライバーによって返される結果セットの基本タイプです。

source: Note below the missing `Try it out` button on the `POST`
ja_jp: `POST` の `Try it out` ボタンがなくなっていることに注意してください。

source: Note for this code to work we need the content of the RSA private key that corresponds to the public key we have in the TokenSecuredResource application. Take the following PEM content and place it into `security-jwt-quickstart/src/test/resources/privateKey.pem`:
ja_jp: このコードが機能するには、TokenSecuredResource アプリケーションにある公開鍵に対応する RSA 秘密鍵のコンテンツが必要であることに注意してください。次の PEM コンテンツを取得し、 `security-jwt-quickstart/src/test/resources/privateKey.pem` に配置します。

source: Note how it retrieves the managed Vert.x instance. While you can use `@Inject`, you can also retrieve it programmatically, the rest of the code does not change. See? No magic for you! We can still start it from the IDE using the _main_ method.
ja_jp: 管理されている Vert.x インスタンスを取得する方法に注目してください。 `@Inject` を使用することができますが、プログラムで取得することも出来、残りのコードは変更しません。ご覧になりましたか?魔法はありません! _メイン_ メソッドを使用して、IDE から起動することができます。

source: Note how the AMQP broker location is configured. The `amqp.host` and `amqp.port` (`AMQP_HOST` and `AMQP_PORT` environment variables) properties configure location.
ja_jp: AMQP ブローカーの場所がどのように設定されているかに注意してください。 `amqp.host` および `amqp.port` (`AMQP_HOST` および `AMQP_PORT` 環境変数) プロパティーは場所を設定します。

source: Note how the RabbitMQ broker location is configured. The `rabbitmq-host` and `rabbitmq-port` (`AMQP_HOST` and `AMQP_PORT` environment variables) properties configure location.
ja_jp: RabbitMQ ブローカーのロケーションがどのように構成されているかに注意してください。 `rabbitmq-host` と `rabbitmq-port` プロパティ( 環境変数だと `AMQP_HOST` と `AMQP_PORT` ) でロケーションを設定します。

source: Note how the paths are specified: `{config:http-path('quarkus.smallrye-openapi.path')}`. This is a special directive that the quarkus dev console understands: it will replace that value with the resolved route named 'quarkus.smallrye-openapi.path'.
ja_jp: パスの指定方法に注意してください: `{config:http-path('quarkus.smallrye-openapi.path')}` 。これは、quarkus devコンソールが理解する特別なディレクティブで、その値を'quarkus.smallrye-openapi.path'という名前の解決済みルートに置き換えます

source: Note how the service is being injected a `FruitDao` instance. This DAO instance is injected automatically, thanks to the generated implementations.
ja_jp: サービスが `FruitDao` インスタンスを注入されていることに注意してください。このDAOインスタンスは、生成された実装のおかげで、自動的に注入されます。

source: Note how the service is being injected a `FruitDao` instance. This DAO instance is injected automatically.
ja_jp: サービスがどのように `FruitDao` インスタンスに注入されているかに注意してください。この DAO インスタンスは自動的に注入されます。

source: Note how the service is being injected with a `FruitDao` instance. This DAO instance is injected automatically, thanks to the generated implementations.
ja_jp: サービスに `FruitDao` インスタンスがどのように注入されているかに注目してください。この DAO インスタンスは、生成された実装のおかげで、自動的に注入されます。

source: Note if you use Keycloak then you should set a Microprofile JWT client scope for ID token to contain a `groups` claim, please see the https://www.keycloak.org/docs/latest/server_admin/#protocol[Keycloak Server Administration Guide] for more information.
ja_jp: Keycloakを使用する場合は、IDトークン用のMicroprofile JWTクライアントスコープに `groups` クレームを含めるように設定する必要があることに注意してください。詳細については、 link:https://www.keycloak.org/docs/latest/server_admin/#protocol[Keycloakサーバー管理ガイド] を参照してください。

source: Note in this case the default client is disabled with a `client-enabled=false` property. The `jwt-secret` client can be accessed like this:
ja_jp: この場合、デフォルトのクライアントは `client-enabled=false` プロパティーで無効になっていることに注意してください。 `jwt-secret` クライアントは以下のようにアクセスできます。

source: Note it is also recommended to use `quarkus.oidc.token.audience` property to verify the token `aud` (`audience`) claim value.
ja_jp: なお、トークン `aud` ( `audience`) のクレーム値を検証するために `quarkus.oidc.token.audience` プロパティを使用することも推奨します。

source: Note it will also bring `io.quarkus:quarkus-oidc-client`.
ja_jp: `io.quarkus:quarkus-oidc-client` も表示されることに注意してください。

source: Note link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP Dependency Check Plugin] `6.5.3` or later should be used with Quarkus.
ja_jp: 注 link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP Dependency Check Plugin] `6.5.3` 、またはそれ以降をQuarkusと共に使用する必要があります。

source: Note on Spring Web
ja_jp: Spring Web に関する注意

source: Note on implementing or extending generic types
ja_jp: ジェネリック型の実装または拡張に関する注意

source: Note on using Elliptic Curve keys
ja_jp: 楕円曲線鍵使用時の注意点

source: Note only the default tenant configuration applies when controlling an anonymous access to the public resource is required.
ja_jp: 公開リソースへの匿名アクセスを制御する必要がある場合は、デフォルトのテナント構成のみが適用されることに注意してください。

source: Note only the default tenant configuration applies when controlling anonymous access to the public resource is required.
ja_jp: なお、パブリックリソースへの匿名のアクセスを制御する必要がある場合は、デフォルトのテナント設定のみが適用されます。

source: Note that 2.9 and earlier are not affected by the issue.
ja_jp: なお、2.9以前のバージョンでは、この問題の影響はありません。

source: Note that <<serialization-autodetection,the auto-detection for Kafka serializers>> doesn't work for signatures using the `Targeted`.
ja_jp: <<serialization-autodetection,the auto-detection for Kafka serializers>> は、 `Targeted` を使用したシグネチャーでは機能しません。

source: Note that Infinispan documentation refers to a `hotrod-client.properties` file. You can configure the Infinispan client with either properties file but `application.properties` always takes priority over `hotrod-client.properties`.
ja_jp: Infinispanのドキュメントでは、 `hotrod-client.properties` のファイルを参照していることに注意してください。どちらのプロパティ・ファイルでもInfinispanクライアントを設定できますが、 `application.properties` は常に `hotrod-client.properties` よりも優先されます。

source: Note that RESTEasy Reactive can be used for reactive but also for traditional blocking workloads.
ja_jp: なお、RESTEasy Reactiveは、リアクティブなワークロードだけでなく、従来のブロッキングなワークロードにも使用できます。

source: Note that UPX compression:
ja_jp: なお、UPX圧縮は以下に注意してください。

source: Note that `/project` is a folder within the container that is building the native executable. So, this is not a folder that you will find in the host environment. `/project` folder is mapped to `target/debugging-native-1.0.0-SNAPSHOT-native-image-source-jar`, so you will find the files under the `reports` folder in that directory.
ja_jp: `/project` は、ネイティブ実行可能ファイルをビルドしているコンテナー内のフォルダーであることに注意してください。したがって、これはホスト環境にあるフォルダーではありません。 `/project` フォルダーは `target/debugging-native-1.0.0-SNAPSHOT-native-image-source-jar` にマップされているため、そのディレクトリーの `reports` フォルダーの下にファイルがあります。

source: Note that `:` characters in the property keys must be escaped.
ja_jp: プロパティーキー内の `:` 文字は、エスケープする必要があることに注意してください。

source: Note that `@TestSecurity` `user` and `roles` attributes are available as `TokenIntrospection` `username` and `scope` properties and you can use `io.quarkus.test.security.oidc.TokenIntrospection` to add the additional introspection response properties such as an `email`, etc.
ja_jp: `@TestSecurity` `user` および `roles` 属性は `TokenIntrospection` `username` および `scope` プロパティーとして使用可能で、 `io.quarkus.test.security.oidc.TokenIntrospection` を使用してさらに `email` などのイントロスペクション応答プロパティーを追加できることに注意してください。

source: Note that `@TestSecurity` annotation must always be used and its `user` property is returned as `JsonWebToken.getName()` and `roles` property - as `JsonWebToken.getGroups()`. `@JwtSecurity` annotation is optional and can be used to set the additional token claims.
ja_jp: `@TestSecurity` アノテーションは常に使用する必要があり、その `user` プロパティーは `JsonWebToken.getName()` として返され、 `roles` プロパティーは `JsonWebToken.getGroups()` として返されることに注意してください。 `@JwtSecurity` アノテーションはオプションであり、追加のトークンクレームを設定するために使用できます。

source: Note that `@TestSecurity` annotation must always be used and its `user` property is returned as `JsonWebToken.getName()` and `roles` property - as `JsonWebToken.getGroups()`. `@OidcSecurity` annotation is optional and can be used to set the additional token claims, as well as `UserInfo` and `OidcConfigurationMetadata` properties. Additionally, if `quarkus.oidc.token.issuer` property is configured then it will be used as an `OidcConfigurationMetadata` `issuer` property value.
ja_jp: `@TestSecurity` アノテーションは常に使用する必要があり、その `user` プロパティーは `JsonWebToken.getName()` として返され、 `roles` プロパティーは `JsonWebToken.getGroups()` として返されることに注意してください。 `@OidcSecurity` アノテーションはオプションであり、追加のトークンクレームおよび `UserInfo` プロパティーと `OidcConfigurationMetadata` プロパティーを設定するために使用できます。さらに、 `quarkus.oidc.token.issuer` プロパティーが設定されている場合、 `OidcConfigurationMetadata` `issuer` プロパティー値として使用されます。

source: Note that `AccessTokenCredential` will have to be used if the Access Token issued to the Quarkus `web-app` application is opaque (binary) and can not be parsed to `JsonWebToken`.
ja_jp: Quarkus `web-app` アプリケーションに発行された Access Token が Opaque (バイナリー) で、 `JsonWebToken` にパースできない場合は、 `AccessTokenCredential` を使用しなければならないことに注意してください。

source: Note that `InterceptionProxy` only supports `@AroundInvoke` interceptors declared on interceptor classes. Other kinds of interception, as well as `@AroundInvoke` interceptors declared on the target class and its superclasses, are not supported.
ja_jp: `InterceptionProxy` は、インターセプタークラスで宣言された `@AroundInvoke` インターセプターのみをサポートすることに注意してください。 他の種類のインターセプション、およびターゲットクラスとそのスーパークラスで宣言された `@AroundInvoke` インターセプターはサポートされていません。

source: Note that `JSON` schema type enforces schema validation.
ja_jp: `JSON` スキーマタイプは、スキーマ検証を適用することに注意してください。

source: Note that `MyClassRequiringReflection` and `MySecondClassRequiringReflection` will be registered for reflection but not `MyReflectionConfiguration`.
ja_jp: なお、 `MyClassRequiringReflection` と `MySecondClassRequiringReflection` はリフレクションに登録されますが、 `MyReflectionConfiguration` は登録されません。

source: Note that `MyInterface` and all its super interfaces will be registered.
ja_jp: `MyInterface` とそのすべてのスーパーインターフェイスが登録されることに注意してください。

source: Note that `QuarkusUnitTest` is in the `quarkus-junit-internal` module.
ja_jp: `QuarkusUnitTest` は `quarkus-junit-internal` モジュールにあることに注意してください。

source: Note that `QuarkusUnitTest` is in the `quarkus-junit5-internal` module.
ja_jp: なお、 `QuarkusUnitTest` は、 `quarkus-junit5-internal` モジュールに入っています。
